{"keras_version": "2.1.1", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, null, 71]}}, {"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, null, 94]}}, {"name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "return_sequences": false, "unit_forget_bias": true, "return_state": true, "implementation": 1, "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "units": 256, "unroll": false, "kernel_regularizer": null}}, {"name": "lstm_2", "class_name": "LSTM", "inbound_nodes": [[["input_2", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]], "config": {"trainable": true, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "return_sequences": true, "unit_forget_bias": true, "return_state": true, "implementation": 1, "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "units": 256, "unroll": false, "kernel_regularizer": null}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 94, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}}